&НаКлиенте
Перем RegExp;

&НаСервере
Процедура ОткрытьШаблон(ИмяМакета)
    ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	ПолеХТМЛ = ОтчетОбъект.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОткрытьШаблон("ЗаявлениеКТС");
	RegExp = Новый COMОбъект("VBScript.RegExp"); // создаем объект для работы с регулярными выражениями
	RegExp.MultiLine = Истина;  // истина — текст многострочный, ложь — одна строка
	RegExp.Global = Истина;     // истина — поиск по всей строке, ложь — до первого совпадения
	RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске
	
	Отпуск = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаявлениеКТС(Команда)
	RegExp.Pattern = "<dolzhnost>(.|\n)*?<\/dolzhnost>"; // должность
	ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, "<dolzhnost>"+Объект.Должность+"</dolzhnost>");
	
	RegExp.Pattern = "<uchastok>(.|\n)*?<\/uchastok>"; // участок
	ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, "<uchastok>"+Объект.Участок+" </uchastok>");
	
	RegExp.Pattern = "<fio>(.|\n)*?<\/fio>"; // ФИО
	ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, "<fio>"+Объект.ФИО+"</fio>");
	
	RegExp.Pattern = "<data_priema>(.|\n)*?<\/data_priema>"; // дата приёма
	ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, "<data_priema>"+Формат(Объект.ДатаПриёма, "ДЛФ=Д")+"</data_priema>");
	
	RegExp.Pattern = "<data_dogovora>(.|\n)*?<\/data_dogovora>"; // дата договора
	ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, "<data_dogovora>"+Формат(Объект.ДатаДоговора, "ДЛФ=Д")+"</data_dogovora>");
	
	RegExp.Pattern = "<nomer_dogovora>(.|\n)*?<\/nomer_dogovora>"; // номер договора
	ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, "<nomer_dogovora>"+Объект.НомерДоговора+"</nomer_dogovora>");
	
	
КонецПроцедуры


&НаКлиенте
Процедура СформироватьУдостоверение(Команда)
	RegExp.Pattern = "<nomer_ud>(.|\n)*?<\/nomer_ud>"; // номер удостоверения
	ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, "<nomer_ud>"+Формат(Объект.НомерУдостоверения, "ЧЦ=1")+"</nomer_ud>");
	
	RegExp.Pattern = "<data_ud>(.|\n)*?<\/data_ud>"; // дата удостоверения
	ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, "<data_ud>"+Формат(Объект.ДатаУдостоверения, "ДЛФ=Д")+" г.</data_ud>");
	
	RegExp.Pattern = "<nomer_resh>(.|\n)*?<\/nomer_resh>"; // номер решения
	ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, "<nomer_resh>"+Формат(Объект.НомерРешения, "ЧЦ=1")+"</nomer_resh>");
	
	RegExp.Pattern = "<data_resh>(.|\n)*?<\/data_resh>"; // дата решения
	ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, "<data_resh>"+Формат(Объект.ДатаРешения, "ДЛФ=ДД")+"</data_resh>");
	

КонецПроцедуры


&НаКлиенте
Процедура СформироватьЗаявлениеБанк(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ВидыДокументовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОткрытьШаблон(ТекущаяСтраница.Имя);
КонецПроцедуры


&НаКлиенте
Процедура УвольнениеПриИзменении(Элемент)
КонецПроцедуры


&НаКлиенте
Процедура ОтпускПриИзменении(Элемент)
	Перем Matches;
	Перем Match;
	Перем Submatches;
	Перем Submatch;
	Перем Сч;
	
	RegExp.Pattern = "<otpusk>(.|\n)*?<\/otpusk>"; // ищем текст об отпуске
	Если НЕ Отпуск Тогда
		// вырезаем кусок текста про отпуск
		// сохраняем
		Matches = RegExp.Execute(ПолеХТМЛ);
		Match = Matches.Item(0);
        Объект.ОтпускКусок = Match.Value;
		// вырезаем
		ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, "<otpusk></otpusk>");
	Иначе
		//вставляем кусок текста про отпуск
		ПолеХТМЛ = RegExp.Replace(ПолеХТМЛ, Объект.ОтпускКусок);
		Объект.ОтпускКусок = "";
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Печатать(Команда)
	//ПолеХТМЛ.Документ.execCommand("Print");
	ЭтаФорма.Элементы.ПолеХТМЛ.Документ.execCommand("Print");
КонецПроцедуры

