&НаКлиенте
Перем RegExp;

&НаСервере
Функция ПодчеркнутьТекстВМакете(Строка)  
	Результат = "";
	Для Индекс = 1 По СтрДлина(Строка) Цикл
		Если Сред(Строка, Индекс, 1) <> " " И Сред(Строка, Индекс, 1) <> "_" И Сред(Строка, Индекс, 1) <> "-" Тогда 
			Результат = Результат + Символ(863);
		КонецЕсли;
		Результат = Результат + Сред(Строка, Индекс, 1);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьАдресОрганизации()
	Со = новый СообщениеПользователю;
	Адрес = "";
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка,
	|ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	|ОрганизацииКонтактнаяИнформация.Вид КАК Вид,
	|ОрганизацииКонтактнаяИнформация.Представление КАК Представление
	|ИЗ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ ОрганизацииКонтактнаяИнформация.Ссылка = &Ссылка
	|И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)";
	Запрос.УстановитьПараметр("Ссылка",Справочники.Организации.ОрганизацияПоУмолчанию());
	ВыбЗапрос = Запрос.Выполнить().Выбрать();
	Если ВыбЗапрос.Следующий() Тогда
		Адрес = ВыбЗапрос.Представление;
	КонецЕсли;	
	Возврат Адрес;
КонецФункции	
&НаСервере
Процедура ПериодВыплаты(СтрСотр,МесЗарп,МесяцЗарплаты,ГодЗарплаты)
	МесЗарп = Месяц(СтрСотр.ПериодВыплаты);
	ГодЗарплаты = Год(СтрСотр.ПериодВыплаты);
	Если МесЗарп = 1 Тогда
		МесяцЗарплаты = "января";
	ИначеЕсли МесЗарп = 2 Тогда
		МесяцЗарплаты = "февраля";
	ИначеЕсли МесЗарп = 3 Тогда
		МесяцЗарплаты = "марта";
	ИначеЕсли МесЗарп = 4 Тогда
		МесяцЗарплаты = "апреля";
	ИначеЕсли МесЗарп = 5 Тогда
		МесяцЗарплаты = "мая";
	ИначеЕсли МесЗарп = 6 Тогда
		МесяцЗарплаты = "июня";
	ИначеЕсли МесЗарп = 7 Тогда
		МесяцЗарплаты = "июля";
	ИначеЕсли МесЗарп = 8 Тогда
		МесяцЗарплаты = "августа";
	ИначеЕсли МесЗарп = 9 Тогда
		МесяцЗарплаты = "сентября";
	ИначеЕсли МесЗарп = 10 Тогда
		МесяцЗарплаты = "октября";
	ИначеЕсли МесЗарп = 11 Тогда
		МесяцЗарплаты = "ноября";
	Иначе
		МесяцЗарплаты = "декабря";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Прием(Сотр,ДатаПриема,ДоговорОт,ДоговорНомер,ДатаРождения)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриемНаРаботу.Сотрудник.Ссылка КАК СотрудникСсылка,
	|	ПриемНаРаботу.ДатаПриема КАК ДатаПриема,
	|	ПриемНаРаботу.ФизическоеЛицо.Ссылка КАК ФизическоеЛицоСсылка,
	|	ПриемНаРаботу.ФизическоеЛицо.Наименование КАК ФизическоеЛицоНаименование,
	|	ПриемНаРаботу.Сотрудник.Наименование КАК СотрудникНаименование,
	|	ПриемНаРаботу.ФизическоеЛицо.ДатаРождения КАК ФизическоеЛицоДатаРождения,
	|	ПриемНаРаботу.Дата КАК Дата,
	|	ПриемНаРаботу.ТрудовойДоговорНомер КАК ТрудовойДоговорНомер,
	|	ПриемНаРаботу.ТрудовойДоговорДата КАК ТрудовойДоговорДата
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Проведен = ИСТИНА
	|	И ПриемНаРаботу.Сотрудник.Ссылка = &Сотр
	|
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникНаименование";
	Запрос.УстановитьПараметр("Сотр",Сотр);
	ВыбЗапрос = Запрос.Выполнить().Выбрать();
	Пока ВыбЗапрос.Следующий() Цикл
		ДатаПриема = ВыбЗапрос.ДатаПриема;
		ДоговорОт = ВыбЗапрос.ТрудовойДоговорДата;
		ДоговорНомер = ВыбЗапрос.ТрудовойДоговорНомер;
		ДатаРождения = ВыбЗапрос.ФизическоеЛицоДатаРождения;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ВзятьШаблон(ИмяМакета);
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОтчетОбъект.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
КонецФункции

&НаСервере
Процедура ОткрытьШаблон(ИмяМакета)
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	ЭтаФорма.ПолеХТМЛ = ОтчетОбъект.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
КонецПроцедуры

&НаСервере
Функция ПолучитьДолжностьСотрудника(Сот)
	Со = Новый СообщениеПользователю;
	ЗапросПоСотрудникам = Новый Запрос;
	ЗапросПоСотрудникам.Текст = "ВЫБРАТЬ
	|	КадроваяИсторияСотрудников.Должность.Ссылка КАК ДолжностьСсылка,
	|	КадроваяИсторияСотрудников.Сотрудник.Ссылка КАК СотрудникСсылка,
	|	КадроваяИсторияСотрудников.Должность.Наименование КАК ДолжностьНаименование,
	|	КадроваяИсторияСотрудников.Период КАК Период
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
	|ГДЕ
	|	КадроваяИсторияСотрудников.Сотрудник.Ссылка = &Сотр
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	ЗапросПоСотрудникам.Параметры.Вставить("Сотр", Сот);
	ВыбЗапрос = ЗапросПоСотрудникам.Выполнить().Выбрать();
	Должность = "";
	//Со.Текст = Строка(ВыбЗапрос.Количество());
	//Со.Сообщить();
	Если ВыбЗапрос.Следующий() Тогда
		Должность = Сред(ВыбЗапрос.ДолжностьНаименование,1,140);
	КонецЕсли;
	Возврат Должность;
	
КонецФункции

&НаСервере
Функция ПолучитьПаспортСотрудника(Сот)
	Со = Новый СообщениеПользователю;
	ЗапросПоСотрудникам = Новый Запрос;
	ЗапросПоСотрудникам.Текст = "ВЫБРАТЬ
	                            |	ДокументыФизическихЛицСрезПоследних.Серия + "" "" + ДокументыФизическихЛицСрезПоследних.Номер КАК Паспорт
	                            |ИЗ
	                            |	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(, ) КАК ДокументыФизическихЛицСрезПоследних
	                            |ГДЕ
	                            |	ДокументыФизическихЛицСрезПоследних.Физлицо = &Физлицо";
	ЗапросПоСотрудникам.Параметры.Вставить("Физлицо", Сот.ФизическоеЛицо);
	ВыбЗапрос = ЗапросПоСотрудникам.Выполнить().Выбрать();
	Должность = "";
	//Со.Текст = Строка(ВыбЗапрос.Количество());
	//Со.Сообщить();
	Если ВыбЗапрос.Следующий() Тогда
		Паспорт = ВыбЗапрос.Паспорт;
	КонецЕсли;
	Возврат Паспорт;
	
КонецФункции


&НаСервере
Процедура ВедомостиОтметкаПриИзмененииНаСервере(инд)
	// Вставить содержимое обработчика.
	//Со = новый СообщениеПользователю;
	//Со.Текст = ЭтаФорма.Элементы.Ведомости.ТекущиеДанные;
	//Со.Сообщить();
	//Возврат;
	СтрВед = ЭтаФорма.Ведомости.Получить(инд);
	Для шаг = 0 По СтрВед.Ведомость.Зарплата.Количество()-1 Цикл
		Стр = СтрВед.Ведомость.Зарплата.Получить(шаг);
		//Док = Документы.ВедомостьНаВыплатуЗарплатыВБанк.СоздатьДокумент();
		//Док.Состав.Найти(Стр.ИдентификаторСтроки);
		СтрСостав = СтрВед.Ведомость.Состав.Найти(Стр.ИдентификаторСтроки);
		Подразделение = "";
		Подразделение1 = "";
		КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Стр.Сотрудник, "Подразделение", ТекущаяДата());
		Если КадровыеДанныеСотрудника.Количество() > 0 Тогда
			ТекущиеКадровыеДанныеСотрудника = КадровыеДанныеСотрудника[0];
			Подразделение = СокрЛП(ТекущиеКадровыеДанныеСотрудника.Подразделение);
			Подразделение = СтрЗаменить(Подразделение,"(рабочие)","") ;
			Подразделение = СокрЛП(СтрЗаменить(Подразделение,"(ИТР)","")) ;
		КонецЕсли;
		Должность = СокрЛП(ПолучитьДолжностьСотрудника(Стр.Сотрудник));
		Паспорт = СокрЛП(ПолучитьПаспортСотрудника(Стр.Сотрудник));
		НомУд =  СокрЛП(СтрВед.Ведомость.Номер) + "_" + Строка(шаг+1);
		СпособВыплаты = СтрВед.СпособВыплаты.Наименование;
		Найден = ложь;
		Для шаг1 = 0 По ЭтаФорма.Сотрудники.Количество()-1 Цикл
			Стр1 = ЭтаФорма.Сотрудники.Получить(шаг1);
			Если Стр.Сотрудник = Стр1.Сотрудник и Должность = СокрЛП(Стр1.Должность) и Подразделение = СокрЛП(Стр1.Подразделение) Тогда
				Найден = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если не найден Тогда
			Если СтрВед.Отметка = Истина Тогда
				Если Стр.КВыплате <> 0 Тогда
					Стр1 = ЭтаФорма.Сотрудники.Добавить();
					Стр1.ПорПеч = 888;
					Стр1.СуммаОтпуск = 0;
					Стр1.СуммаЗарплата = 0;
					Стр1.Сотрудник = Стр.Сотрудник;
					Стр1.Должность = Должность;
					Стр1.Паспорт = Паспорт;
					Стр1.Подразделение = Подразделение;
					Стр1.НомерУдостоверения = Стр.Сотрудник.Код;
					Стр1.СпособВыплаты = СтрВед.Ведомость.СпособВыплаты;
					Если ТипЗнч(Стр.ДокументОснование) = Тип("ДокументСсылка.Отпуск") или ТипЗнч(Стр.ДокументОснование) = Тип("ДокументСсылка.Увольнение") Тогда
						Стр1.ДокументОснование = Стр.ДокументОснование;
					КонецЕсли;	
					Если СпособВыплаты = "Отпуска" Тогда
						Стр1.СуммаОтпуск = Стр1.СуммаОтпуск + Стр.КВыплате;
					Иначе
						Стр1.СуммаЗарплата = Стр1.СуммаЗарплата + Стр.КВыплате;
						Если ЗначениеЗаполнено(Стр.ДокументОснование) Тогда
							Если ТипЗНЧ(Стр.ДокументОснование) <> Тип("ДокументСсылка.Отпуск") и ТипЗНЧ(Стр.ДокументОснование) <> Тип("ДокументСсылка.Увольнение") Тогда // и ТипЗНЧ(Стр.ДокументОснование) <> Тип("ДокументСсылка.БольничныйЛист")
								Стр1.ПериодВыплаты = Стр.ПериодВзаиморасчетов;
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;
					Стр1.Банк = ?(СтрСостав.БанковскийСчет.Банк = Справочники.КлассификаторБанков.ПустаяСсылка(), СтрВед.Ведомость.ЗарплатныйПроект.Банк, СтрСостав.БанковскийСчет.Банк);
					Стр1.ЛицевойСчет = Стр.НомерЛицевогоСчета;
				КонецЕсли;
			КонецЕсли		
		Иначе	
			Если СтрВед.Отметка = Ложь Тогда
				Если СпособВыплаты = "Отпуска" Тогда
					Стр1.СуммаОтпуск = Стр1.СуммаОтпуск - Стр.КВыплате;
				Иначе
					Стр1.СуммаЗарплата = Стр1.СуммаЗарплата - Стр.КВыплате;
				КонецЕсли;
				Если Стр1.СуммаОтпуск + Стр1.СуммаЗарплата = 0 Тогда
					ЭтаФорма.Сотрудники.Удалить(шаг1);
				КонецЕсли;
			Иначе	
				Если ТипЗнч(Стр.ДокументОснование) = Тип("ДокументСсылка.Отпуск") или ТипЗнч(Стр.ДокументОснование) = Тип("ДокументСсылка.Увольнение") Тогда
					Стр1.ДокументОснование = Стр.ДокументОснование;
				КонецЕсли;	
				Если СпособВыплаты = "Отпуска" Тогда
					Стр1.СуммаОтпуск = Стр1.СуммаОтпуск + Стр.КВыплате;
				Иначе
					Стр1.СуммаЗарплата = Стр1.СуммаЗарплата + Стр.КВыплате;
					Стр1.СпособВыплаты = СтрВед.Ведомость.СпособВыплаты;
					Если ЗначениеЗаполнено(Стр.ДокументОснование) Тогда
						Если ТипЗНЧ(Стр.ДокументОснование) <> Тип("ДокументСсылка.Отпуск") и ТипЗНЧ(Стр.ДокументОснование) <> Тип("ДокументСсылка.Увольнение") Тогда  //и ТипЗНЧ(Стр.ДокументОснование) <> Тип("ДокументСсылка.БольничныйЛист")
							Стр1.ПериодВыплаты = Стр.ПериодВзаиморасчетов;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	ЭтаФорма.Сотрудники.Сортировать("Подразделение,Сотрудник,Должность");
	ЭтаФорма.Зарплата = ЭтаФорма.Сотрудники.Итог("СуммаЗарплата");
	ЭтаФорма.Отпуск = ЭтаФорма.Сотрудники.Итог("СуммаОтпуск");
	ЭтаФорма.Всего = ЭтаФорма.Сотрудники.Итог("СуммаЗарплата") + ЭтаФорма.Сотрудники.Итог("СуммаОтпуск");
КонецПроцедуры

&НаКлиенте
Процедура ВедомостиОтметкаПриИзменении(Элемент)
	инд = ЭтаФорма.Ведомости.Индекс(ЭтаФорма.Элементы.Ведомости.ТекущиеДанные);
	ВедомостиОтметкаПриИзмененииНаСервере(инд);
КонецПроцедуры

&НаСервере
Процедура ВыбратьВедомостиНаСервере()
	// Вставить содержимое обработчика.
	ЭтаФорма.Сотрудники.Очистить();
	ЭтаФорма.Ведомости.Очистить();
	Вед = Документы.ВедомостьНаВыплатуЗарплатыВБанк.Выбрать(НачалоДня(ЭтаФорма.ПериодС),КонецДня(ЭтаФорма.ПериодПо));
	Пока Вед.Следующий() Цикл
		Стр = ЭтаФорма.Ведомости.Добавить();
		Стр.Отметка = Ложь;
		Стр.Ведомость = Вед.Ссылка;
		Стр.СпособВыплаты = Вед.СпособВыплаты.Ссылка;
		СуммаПоВед = 0;
		Для шаг = 0 По Вед.Зарплата.Количество()-1 Цикл
			СтрСумм = Вед.Зарплата.Получить(шаг);
			СуммаПоВед = СуммаПоВед + СтрСумм.КВыплате;
		КонецЦикла;	
		Стр.Сумма = СуммаПоВед;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВедомости(Команда)
	//Если ЭтаФорма.Ведомости.Количество() > 0 или ЭтаФорма.Сотрудники.Количество() > 0 Тогда
	//	Режим = РежимДиалогаВопрос.ДаНет;
	//	Ответ = Вопрос("Списки ведомостей или сотрудников непустые и будут перезаполнены. Продолжить?", Режим, 0,КодВозвратаДиалога.Нет);
	//	Если Ответ = КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда    
	ВыбратьВедомостиНаСервере();
	//	КонецЕсли;
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСотрудников(Команда)
	// Вставить содержимое обработчика.
	Если ЭтаФорма.Сотрудники.Количество() > 0 Тогда
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОтметкаСотрудникПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	инд = ЭтаФорма.Сотрудники.Индекс(ЭтаФорма.Элементы.Сотрудники.ТекущиеДанные);
	СтрСотр = ЭтаФорма.Сотрудники.Получить(инд);
	Если СтрСотр.ОтметкаСотрудник Тогда
		Для шаг = 0 По ЭтаФорма.Сотрудники.Количество()-1 Цикл
			Стр = ЭтаФорма.Сотрудники.Получить(шаг);
			//Если шаг <> инд Тогда
			//	Стр.ОтметкаСотрудник = Ложь
			//КонецЕсли;
			Стр.ОтметкаПодразделение = Ложь;
			Стр.ОтметкаВсе = Ложь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОтметкаПодразделениеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	инд = ЭтаФорма.Сотрудники.Индекс(ЭтаФорма.Элементы.Сотрудники.ТекущиеДанные);
	СтрСотр = ЭтаФорма.Сотрудники.Получить(инд);
	Подр = СтрСотр.Подразделение;
	Если СтрСотр.ОтметкаПодразделение Тогда
		Для шаг = 0 По ЭтаФорма.Сотрудники.Количество()-1 Цикл
			Стр = ЭтаФорма.Сотрудники.Получить(шаг);
			Если шаг <> инд Тогда
				Если Стр.Подразделение = Подр Тогда
					Стр.ОтметкаПодразделение = Истина;
				Иначе
					Стр.ОтметкаПодразделение = Ложь;
				КонецЕсли;	
			КонецЕсли;
			Стр.ОтметкаСотрудник = Ложь;
			Стр.ОтметкаВсе = Ложь;
		КонецЦикла;
	Иначе	
		Для шаг = 0 По ЭтаФорма.Сотрудники.Количество()-1 Цикл
			Стр = ЭтаФорма.Сотрудники.Получить(шаг);
			Стр.ОтметкаПодразделение = Ложь;
			Стр.ОтметкаСотрудник = Ложь;
			Стр.ОтметкаВсе = Ложь;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаявленийНаСервере(реж)
	Со = Новый СообщениеПользователю;
	Объект.Печать.Очистить();
	
	ПолнН = Справочники.Организации.ОрганизацияПоУмолчанию().НаименованиеПолное;
	КратН = Справочники.Организации.ОрганизацияПоУмолчанию().НаименованиеСокращенное;
	ИННорг = Справочники.Организации.ОрганизацияПоУмолчанию().ИНН;
	ОГРНорг = Справочники.Организации.ОрганизацияПоУмолчанию().ОГРН;
	АдресОрганизации = ПолучитьАдресОрганизации();
	
	Если ЭтаФорма.СписокПоУбыванию Тогда
		ЭтаФорма.Сотрудники.Сортировать("ПорПеч,Сотрудник УБЫВ,Должность");
	Иначе	
		ЭтаФорма.Сотрудники.Сортировать("ПорПеч,Сотрудник,Должность");
	КонецЕсли;	
	Для шаг = 0 По ЭтаФорма.Сотрудники.Количество()-1 Цикл
		
		Стр = ЭтаФорма.Сотрудники.Получить(шаг);
		Если Стр.ОтметкаСотрудник или Стр.ОтметкаПодразделение или Стр.ОтметкаВсе Тогда
			
			
			МесЗарп = ""; МесяцЗарплаты = ""; ГодЗарплаты = "";
			ПериодВыплаты(Стр,МесЗарп,МесяцЗарплаты,ГодЗарплаты);
			ВидЗарплаты = Стр.СпособВыплаты.Наименование;
			
			RegExp = Новый COMОбъект("VBScript.RegExp"); // создаем объект для работы с регулярными выражениями
			RegExp.MultiLine = Истина;  // истина — текст многострочный, ложь — одна строка
			RegExp.Global = Истина;     // истина — поиск по всей строке, ложь — до первого совпадения
			RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске
			
			Если реж = 0 или реж = 1 Тогда
				ОткрытьШаблон("ЗаявлениеКТС");
				Объект.Печать.Добавить();
				СтрТЗ = Объект.Печать.Получить(Объект.Печать.Количество()-1);
				СтрТЗ.Документ = ВзятьШаблон("ЗаявлениеКТС");
				
				RegExp.Pattern = "<naim1>(.|\n)*?<\/naim1>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim1>"+ПолнН+"</naim1>");
				RegExp.Pattern = "<naim2>(.|\n)*?<\/naim2>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim2>"+ПолнН+"</naim2>");
				RegExp.Pattern = "<adresorg0>(.|\n)*?<\/adresorg0>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<adresorg0>"+АдресОрганизации+"</adresorg0>");
				RegExp.Pattern = "<naim3>(.|\n)*?<\/naim3>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim3>"+КратН+"</naim3>");
				RegExp.Pattern = "<naim4>(.|\n)*?<\/naim4>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim4>"+КратН+"</naim4>");
				RegExp.Pattern = "<naim5>(.|\n)*?<\/naim5>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim5>"+КратН+"</naim5>");
				RegExp.Pattern = "<naim6>(.|\n)*?<\/naim6>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim6>"+КратН+"</naim6>");
				RegExp.Pattern = "<naim7>(.|\n)*?<\/naim7>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim7>"+КратН+"</naim7>");
				RegExp.Pattern = "<naim8>(.|\n)*?<\/naim8>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim8>"+КратН+"</naim8>");
				RegExp.Pattern = "<naim9>(.|\n)*?<\/naim9>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim9>"+КратН+"</naim9>");
				RegExp.Pattern = "<naim10>(.|\n)*?<\/naim10>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim10>"+КратН+"</naim10>");
				RegExp.Pattern = "<naim11>(.|\n)*?<\/naim11>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim11>"+КратН+"</naim11>");
				RegExp.Pattern = "<naim15>(.|\n)*?<\/naim15>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim15>"+КратН+"</naim15>");
				
				
				
				
				RegExp.Pattern = "<dolzhnost>(.|\n)*?<\/dolzhnost>"; // должность
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dolzhnost>"+Стр.Должность+"</dolzhnost>");
				
				//RegExp.Pattern = "<uchastok>(.|\n)*?<\/uchastok>"; // участок
				//СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<uchastok>"+Стр.Подразделение+" </uchastok>");
				
				RegExp.Pattern = "<fio>(.|\n)*?<\/fio>"; // ФИО
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<fio>"+Стр.Сотрудник+"</fio>");
				
				ДатаПриема = ""; ДоговорОт = ""; ДатаРождения = ""; ДоговорНомер = "";
				Прием(Стр.Сотрудник,ДатаПриема,ДоговорОт,ДоговорНомер,ДатаРождения);
				RegExp.Pattern = "<data_priema>(.|\n)*?<\/data_priema>"; // дата приёма
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<data_priema>"+Формат(ДатаПриема, "ДЛФ=Д")+"</data_priema>");
				
				RegExp.Pattern = "<data_dogovora>(.|\n)*?<\/data_dogovora>"; // дата договора
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<data_dogovora>"+Формат(ДоговорОт, "ДЛФ=Д")+"</data_dogovora>");
				
				RegExp.Pattern = "<nomer_dogovora>(.|\n)*?<\/nomer_dogovora>"; // номер договора
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<nomer_dogovora>"+ДоговорНомер+"</nomer_dogovora>");
				
				RegExp.Pattern = "<dolg_zp>(.|\n)*?<\/dolg_zp>"; // номер договора
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dolg_zp>"+Стр.СуммаЗарплата+"</dolg_zp>");
				
				Если ВидЗарплаты = "Увольнения" Тогда
					//ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп,15);
					Если ЗначениеЗаполнено(Стр.ДокументОснование) Тогда
						RegExp.Pattern = "<nomer_prikaz_uv>(.|\n)*?<\/nomer_prikaz_uv>"; 
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<nomer_prikaz_uv>"+Стр.ДокументОснование.Номер+"</nomer_prikaz_uv>");
						RegExp.Pattern = "<data_prikaz_uv>(.|\n)*?<\/data_prikaz_uv>"; 
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<data_prikaz_uv>"+Формат(Стр.ДокументОснование.Дата, "ДЛФ=Д")+"</data_prikaz_uv>");
						RegExp.Pattern = "<data_uv>(.|\n)*?<\/data_uv>"; 
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<data_uv>"+Формат(Стр.ДокументОснование.ДатаУвольнения, "ДЛФ=Д")+"</data_uv>");
						//Со.Текст = Стр.СуммаЗарплата;
						//Со.Сообщить();
					КонецЕсли;
					RegExp.Pattern = "<dolg_uv>(.|\n)*?<\/dolg_uv>"; 
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dolg_uv>"+Стр.СуммаЗарплата+"</dolg_uv>");
				ИначеЕсли ВидЗарплаты = "Аванс" или ЭтаФорма.ПоловинаМесяца = 1 Тогда
					Если Стр.СуммаЗарплата <> 0 Тогда
						ПериодДолга = "за первую половину " + МесяцЗарплаты + " " + Формат(ГодЗарплаты,"ЧГ=0") + " года";
						Если МесЗарп = 2 Тогда
							ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп,28);
						Иначе
							ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп,30);
						КонецЕсли;	
					Иначе
						ПериодДолга = "";
						ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп,15);
					КонецЕсли;
					ПериодДолга = "";
				Иначе
					Если Стр.СуммаЗарплата <> 0 Тогда
						ПериодДолга = "за вторую половину " + МесяцЗарплаты + " " + Формат(ГодЗарплаты,"ЧГ=0") + " года";
						ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп+1,15);
					Иначе
						ПериодДолга = "";
						ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп+1,15);
						ДатаВыплаты = " нет ";
					КонецЕсли
				КонецЕсли;	
				RegExp.Pattern = "<period_dolga>(.|\n)*?<\/period_dolga>"; // номер договора
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<period_dolga>"+ПериодДолга+"</period_dolga>");
				RegExp.Pattern = "<data_vyplaty>(.|\n)*?<\/data_vyplaty>"; // номер договора
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<data_vyplaty>"+Формат(ДатаВыплаты, "ДЛФ=Д")+"</data_vyplaty>");
				
				Если ВидЗарплаты = "Увольнения" Тогда
					RegExp.Pattern = "<ne_uvolnenie>(.|\n)*?<\/ne_uvolnenie>"; 
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<ne_uvolnenie></ne_uvolnenie>");
				Иначе
					RegExp.Pattern = "<uvolnenie>(.|\n)*?<\/uvolnenie>"; 
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<uvolnenie></uvolnenie>");
				КонецЕсли;	
				
				
				RegExp.Pattern = "<otpusk>(.|\n)*?<\/otpusk>"; // ищем текст об отпуске
				Matches = RegExp.Execute(СтрТЗ.Документ);
				Match = Matches.Item(0);
				Объект.ОтпускКусок = Match.Value;
				Если Стр.СуммаОтпуск <> 0 Тогда
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, Объект.ОтпускКусок);
					RegExp.Pattern = "<dolg_otp>(.|\n)*?<\/dolg_otp>"; // номер договора
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dolg_otp>"+Стр.СуммаОтпуск+"</dolg_otp>");
					Если ЗначениеЗаполнено(Стр.ДокументОснование) Тогда
						RegExp.Pattern = "<nomer_prikaz_otp>(.|\n)*?<\/nomer_prikaz_otp>"; // номер договора
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<nomer_prikaz_otp>"+Стр.ДокументОснование.Номер+"</nomer_prikaz_otp>");
						RegExp.Pattern = "<data_prikaz_otp>(.|\n)*?<\/data_prikaz_otp>"; // номер договора
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<data_prikaz_otp>"+Формат(Стр.ДокументОснование.Дата, "ДЛФ=Д")+"</data_prikaz_otp>");
						ДНачОтп = Стр.ДокументОснование.ДатаНачалаОсновногоОтпуска;
						ДКонОтп = Стр.ДокументОснование.ДатаОкончанияОсновногоОтпуска;
						Для шд = 0 По Стр.ДокументОснование.ДополнительныеОтпуска.Количество()-1 Цикл
							СтрД = Стр.ДокументОснование.ДополнительныеОтпуска.Получить(шд);
							Если Не ЗначениеЗаполнено(ДНачОтп) и шд = 0 Тогда
								ДНачОтп = СтрД.ДатаНачала;
							КонецЕсли;
							ДКонОтп = СтрД.ДатаОкончания;
						КонецЦикла;	
						RegExp.Pattern = "<data_nach_otp>(.|\n)*?<\/data_nach_otp>"; // дата начала отпуска
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<data_nach_otp>"+Формат(ДНачОтп, "ДЛФ=Д")+"</data_nach_otp>");
						RegExp.Pattern = "<data_konca_otp>(.|\n)*?<\/data_konca_otp>"; // дата окончания отпуска
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<data_konca_otp>"+Формат(ДКонОтп, "ДЛФ=Д")+"</data_konca_otp>");
					КонецЕсли;
				Иначе	
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<otpusk></otpusk>");
				КонецЕсли;
				RegExp.Pattern = "<dolg_vsego>(.|\n)*?<\/dolg_vsego>"; // номер договора
				Всего1 =  Стр.СуммаЗарплата + Стр.СуммаОтпуск;
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dolg_vsego>"+Всего1+"</dolg_vsego>");
				
				Если ВидЗарплаты = "Увольнения" Тогда
					RegExp.Pattern = "<Zrp>(.|\n)*?<\/Zrp>"; 
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<Zrp></Zrp>");
					RegExp.Pattern = "<ZrpOtp>(.|\n)*?<\/ZrpOtp>"; 
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<ZrpOtp></ZrpOtp>");
				Иначе
					Если Стр.СуммаЗарплата <> 0 и Стр.СуммаОтпуск <> 0 Тогда
						RegExp.Pattern = "<Uv>(.|\n)*?<\/Uv>"; 
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<Uv></Uv>");
						RegExp.Pattern = "<Zrp>(.|\n)*?<\/Zrp>"; 
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<Zrp></Zrp>");
					ИначеЕсли Стр.СуммаОтпуск <> 0 Тогда
						RegExp.Pattern = "<Uv>(.|\n)*?<\/Uv>"; 
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<Uv></Uv>");
						RegExp.Pattern = "<Zrp>(.|\n)*?<\/Zrp>"; 
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<Zrp></Zrp>");
					Иначе	
						RegExp.Pattern = "<Uv>(.|\n)*?<\/Uv>"; 
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<Uv></Uv>");
						RegExp.Pattern = "<ZrpOtp>(.|\n)*?<\/ZrpOtp>"; 
						СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<ZrpOtp></ZrpOtp>");
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			
			Если реж = 0 или реж = 2 Тогда	
				
				ОткрытьШаблон("ЗаявлениеБанк");
				Объект.Печать.Добавить();
				СтрТЗ = Объект.Печать.Получить(Объект.Печать.Количество()-1);
				СтрТЗ.Документ = ВзятьШаблон("ЗаявлениеБанк");
				
				RegExp.Pattern = "<naim13>(.|\n)*?<\/naim13>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim13>"+КратН+"</naim13>");
				RegExp.Pattern = "<naim14>(.|\n)*?<\/naim14>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim14>"+КратН+"</naim14>");
				RegExp.Pattern = "<adresorg>(.|\n)*?<\/adresorg>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<adresorg>"+АдресОрганизации+"</adresorg>");
				RegExp.Pattern = "<naim12>(.|\n)*?<\/naim12>"; // 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim12>"+ПолнН+"(ИНН "+ИННорг+", ОГРН "+ОГРНорг+")"+"</naim12>");
				
				ФЛ = Стр.Сотрудник.ФизическоеЛицо;
				Пол = 1;
				Если ФЛ.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
					Пол = 2;
				КонецЕсли;	
				ФИОПолноеРодПадеж = СклонениеПредставленийОбъектов.ПросклонятьФИО(Стр.Сотрудник.Наименование, 2, Стр.Сотрудник, Пол);
				RegExp.Pattern = "<fio>(.|\n)*?<\/fio>"; // ФИО
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<fio>"+ФИОПолноеРодПадеж+"</fio>");
				RegExp.Pattern = "<fio1>(.|\n)*?<\/fio1>"; // ФИО
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<fio1>"+Стр.Сотрудник.Наименование+"</fio1>");
				RegExp.Pattern = "<inn>(.|\n)*?<\/inn>"; 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<inn>"+ФЛ.ИНН+"</inn>");
				ДанныеФизЛица = КадровыйУчет.ДокументыФизическихЛиц(ФЛ, Истина); 
				Серия = ДанныеФизЛица[0].Серия;	
				Номер = ДанныеФизЛица[0].Номер;	
				Выдан = ДанныеФизЛица[0].КемВыдан;	
				ДатаВыдачи = ДанныеФизЛица[0].ДатаВыдачи;	
				RegExp.Pattern = "<pasport>(.|\n)*?<\/pasport>"; 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<pasport>"+"Серия "+Серия+" № "+Номер+" выдан "+Выдан+" "+Формат(ДатаВыдачи,"ДЛФ=Д")+"г."+"</pasport>");
				RegExp.Pattern = "<gragd>(.|\n)*?<\/gragd>"; 
				Если Найти(ФЛ.Наименование,"равченко") > 0 Тогда
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<gragd>"+"УКРАИНА"+"</gragd>");
				Иначе
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<gragd>"+"РОССИЯ"+"</gragd>");
				КонецЕсли;	
				//Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФЛ, Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица);
				Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФЛ, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
				Адрес = СтрЗаменить(Адрес,"РОССИЯ,","");
				Адрес = СтрЗаменить(Адрес,"Воркутинский р-н,","");
				RegExp.Pattern = "<adres>(.|\n)*?<\/adres>"; 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<adres>"+Адрес+"</adres>");
				
				RegExp.Pattern = "<dataud>(.|\n)*?<\/dataud>"; 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dataud>"+Формат(ЭтаФорма.УдостоверениеДата,"ДЛФ=Д")+"</dataud>");
				
				RegExp.Pattern = "<poviplate>(.|\n)*?<\/poviplate>"; 
				Если Стр.СуммаЗарплата<>0 и Стр.Суммаотпуск<>0 Тогда
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<poviplate></poviplate>");
				ИначеЕсли Стр.СуммаЗарплата<>0 Тогда
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<poviplate></poviplate>");
				Иначе
					СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<poviplate></poviplate>");
				КонецЕсли;
				
				бНаименование = Стр.Банк.Наименование;
				RegExp.Pattern = "<naimB>(.|\n)*?<\/naimB>"; 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naimB>"+Стр.Банк.Наименование+"</naimB>");
				бБИК = Стр.Банк.Код;
				RegExp.Pattern = "<bikB>(.|\n)*?<\/bikB>"; 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<bikB>"+Стр.Банк.Код+"</bikB>");
				бИНН = Стр.Банк.ИНН;
				RegExp.Pattern = "<innB>(.|\n)*?<\/innB>"; 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<innB>"+Стр.Банк.ИНН+"</innB>");
				бКоррСчет = Стр.Банк.КоррСчет;
				RegExp.Pattern = "<korrsB>(.|\n)*?<\/korrsB>"; 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<korrsB>"+Стр.Банк.КоррСчет+"</korrsB>");
				бСчет = Стр.ЛицевойСчет;
				RegExp.Pattern = "<rs>(.|\n)*?<\/rs>"; 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<rs>"+Стр.ЛицевойСчет+"</rs>");
				
				RegExp.Pattern = "<summa>(.|\n)*?<\/summa>";
				Всего1 =  Стр.СуммаЗарплата + Стр.СуммаОтпуск;
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<summa>"+Всего1+"</summa>");
				
				RegExp.Pattern = "<dataud>(.|\n)*?<\/dataud>"; 
				СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dataud>"+Формат(ЭтаФорма.УдостоверениеДата,"ДЛФ=ДД")+"</dataud>");
				
				
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	ЭтаФорма.Сотрудники.Сортировать("Подразделение,Сотрудник,Должность");
	
	ЭтаФорма.ПолеХТМЛ = "";
	Для шаг = 0 По Объект.Печать.Количество()-1 Цикл
		Стр = Объект.Печать.Получить(шаг);
		ЭтаФорма.ПолеХТМЛ = ЭтаФорма.ПолеХТМЛ + Стр.Документ;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявлений(Команда)
	ПечатьЗаявленийНаСервере(0);
	ЭтаФорма.ОбновитьОтображениеДанных(ЭтаФорма.Элементы.ПолеХТМЛ);
	ЭтаФорма.Элементы.ПолеХТМЛ.Документ.execCommand("Print");
	
КонецПроцедуры

&НаСервере
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",",
    Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
 
    Результат = Новый Массив;
 
    // для обеспечения обратной совместимости
    Если ПропускатьПустыеСтроки = Неопределено Тогда
        ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
        Если ПустаяСтрока(Строка) Тогда 
            Если Разделитель = " " Тогда
                Результат.Добавить("");
            КонецЕсли;
            Возврат Результат;
        КонецЕсли;
    КонецЕсли;
    //
 
    Позиция = Найти(Строка, Разделитель);
    Пока Позиция > 0 Цикл
        Подстрока = Лев(Строка, Позиция - 1);
        Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
            Результат.Добавить(Подстрока);
        КонецЕсли;
        Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
        Позиция = Найти(Строка, Разделитель);
    КонецЦикла;
 
    Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
        Результат.Добавить(Строка);
    КонецЕсли;
 
    Возврат Результат;
 
КонецФункции


&НаСервере
Функция ФамилияИнициалыФизЛица(Объект = "", Фамилия = " ", Имя = " ", Отчество = " ") Экспорт

ТипОбъекта = ТипЗнч(Объект);
Если ТипОбъекта = Тип("Строка") Тогда
ФИО = РазложитьСтрокуВМассивПодстрок(СокрЛП(Объект)," ");
ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ФизическиеЛица") или ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") Тогда 
ФИО = РазложитьСтрокуВМассивПодстрок(СокрЛП(Объект.Наименование)," ");
Иначе

// используем возможно переданные отдельные строки
Возврат ?(НЕ ПустаяСтрока(Фамилия), 
Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""),
"")
КонецЕсли;

КоличествоПодстрок = ФИО.Количество();
Фамилия = ?(КоличествоПодстрок > 0,ФИО[0],"");
Имя        = ?(КоличествоПодстрок > 1,ФИО[1],"");
Отчество= ?(КоличествоПодстрок > 2,ФИО[2],"");

Возврат ?(НЕ ПустаяСтрока(Фамилия), 
Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""),
"");

КонецФункции

&НаСервере
Функция ПечатьУдостоверенийНаСервере()
	// Вставить содержимое обработчика.
	
	ПолнН = Справочники.Организации.ОрганизацияПоУмолчанию().НаименованиеПолное;
	КратН = Справочники.Организации.ОрганизацияПоУмолчанию().НаименованиеСокращенное;
	ИННорг = Справочники.Организации.ОрганизацияПоУмолчанию().ИНН;
	ОГРНорг = Справочники.Организации.ОрганизацияПоУмолчанию().ОГРН;
	АдресОрганизации = ПолучитьАдресОрганизации();
	
	Объект.Печать.Очистить();
	
	Если ЭтаФорма.СписокПоУбыванию Тогда
		ЭтаФорма.Сотрудники.Сортировать("ПорПеч,Сотрудник УБЫВ,Должность");
	Иначе	
		ЭтаФорма.Сотрудники.Сортировать("ПорПеч,Сотрудник,Должность");
	КонецЕсли;	

	ТабДок = Новый ТабличныйДокумент;
	Обработка =  РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("УдостоверениеБанк");
	Шапка = Макет.ПолучитьОбласть("ОбластьШапка");
	Шапка.Параметры.Организация = ПолнН;
	Шапка.Параметры.ИНН = ИННорг;
	Шапка.Параметры.НомерРешения = РешениеНомер;
	Шапка.Параметры.ОбщаяСумма = Формат(Всего,"ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧГ=3,0");
	Шапка.Параметры.ДатаРешения = Формат(РешениеДата, "ДФ=dd.MM.yyyy; ДЛФ=D");
	Шапка.Параметры.АдресОрганизации = АдресОрганизации;
	Шапка.Параметры.ДатаУдостоверения = Формат(УдостоверениеДата, "ДФ=dd.MM.yyyy; ДЛФ=D");
	Шапка.Параметры.СуммаПрописью = ЧислоПрописью(Всего, ,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж");
	ТабДок.Вывести(Шапка);
	ПечСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
	Подвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	Подвал.Параметры.Организация = ПолнН;
	Подвал.Параметры.ИНН = ИННорг;
	Подвал.Параметры.ДатаРешения = Формат(РешениеДата, "ДФ=dd.MM.yyyy; ДЛФ=D");
	Подвал.Параметры.ДатаВступилоВСилу = Формат(РешениеДата, "ДФ=dd.MM.yyyy; ДЛФ=D");
	Подвал.Параметры.ПредседательФИО = ФамилияИнициалыФизЛица(ЭтаФорма.Председатель.ФизическоеЛицо);
	НомерПП = 1;
	Для шаг = 0 По ЭтаФорма.Сотрудники.Количество()-1 Цикл
		Стр = ЭтаФорма.Сотрудники.Получить(шаг);
		Если Стр.ОтметкаСотрудник или Стр.ОтметкаПодразделение или Стр.ОтметкаВсе Тогда

			ПечСтрока.Параметры.НомерПП = НомерПП;
			ПечСтрока.Параметры.ФИО = Стр.Сотрудник;
			ПечСтрока.Параметры.ИНН = Стр.Сотрудник.ФизическоеЛицо.ИНН;
			Всего1 =  Стр.СуммаЗарплата + Стр.СуммаОтпуск;
			ПечСтрока.Параметры.Сумма = Всего1;
			ПечСтрока.Параметры.Паспорт = Стр.Паспорт;
			//ПечСтрока.Параметры.НомерУдостоверения = Стр.НомерУдостоверения;
			ТабДок.Вывести(ПечСтрока);
			НомерПП = НомерПП+1;
			
			//МесЗарп = ""; МесяцЗарплаты = ""; ГодЗарплаты = "";
			//ПериодВыплаты(Стр,МесЗарп,МесяцЗарплаты,ГодЗарплаты);
			//ВидЗарплаты = Стр.СпособВыплаты.Наименование;
			//ОткрытьШаблон("Удостоверение");
			
			
		//	RegExp = Новый COMОбъект("VBScript.RegExp"); // создаем объект для работы с регулярными выражениями
		//	RegExp.MultiLine = Истина;  // истина — текст многострочный, ложь — одна строка
		//	RegExp.Global = Истина;     // истина — поиск по всей строке, ложь — до первого совпадения
		//	RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске
		//	Объект.Печать.Добавить();
		//	СтрТЗ = Объект.Печать.Получить(Объект.Печать.Количество()-1);
		//	СтрТЗ.Документ = ВзятьШаблон("Удостоверение");
		//	
		//	RegExp.Pattern = "<naim1>(.|\n)*?<\/naim1>"; // 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim1>"+ПолнН+"</naim1>");
		//	RegExp.Pattern = "<naim2>(.|\n)*?<\/naim2>"; // 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim2>"+ПолнН+"</naim2>");
		//	RegExp.Pattern = "<naim3>(.|\n)*?<\/naim3>"; // 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim3>"+ПолнН+"</naim3>");
		//	RegExp.Pattern = "<naim4>(.|\n)*?<\/naim4>"; // 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<naim4>"+ПолнН+"</naim4>");
		//	RegExp.Pattern = "<INNorg>(.|\n)*?<\/INNorg>"; // 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<INNorg>"+ИННорг+"</INNorg>");
		//	RegExp.Pattern = "<OGRNorg>(.|\n)*?<\/OGRNorg>"; // 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<OGRNorg>"+ОГРНорг+"</OGRNorg>");
		//	RegExp.Pattern = "<adresorg>(.|\n)*?<\/adresorg>"; // 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<adresorg>"+АдресОрганизации+"</adresorg>");
		//	RegExp.Pattern = "<adresorg1>(.|\n)*?<\/adresorg1>"; // 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<adresorg1>"+АдресОрганизации+"</adresorg1>");
		//	
		//	RegExp.Pattern = "<nomer_ud>(.|\n)*?<\/nomer_ud>"; 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<nomer_ud>"+Стр.НомерУдостоверения+"</nomer_ud>");
		//	
		//	RegExp.Pattern = "<data_ud>(.|\n)*?<\/data_ud>"; 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<data_ud>"+Формат(ЭтаФорма.УдостоверениеДата,"ДЛФ=Д")+"</data_ud>");
		//	
		//	RegExp.Pattern = "<nomer_resh>(.|\n)*?<\/nomer_resh>"; 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<nomer_resh>"+ЭтаФорма.РешениеНомер+"</nomer_resh>");
		//	
		//	RegExp.Pattern = "<data_resh>(.|\n)*?<\/data_resh>"; 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<data_resh>"+Формат(ЭтаФорма.РешениеДата,"ДЛФ=Д")+"</data_resh>");
		//	
		//	RegExp.Pattern = "<fio>(.|\n)*?<\/fio>"; // ФИО
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<fio>"+Стр.Сотрудник+"</fio>");
		//	
		//	RegExp.Pattern = "<data_r>(.|\n)*?<\/data_r>"; 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<data_r>"+Формат(Стр.Сотрудник.ФизическоеЛицо.ДатаРождения,"ДЛФ=Д")+"</data_r>");
		//	
		//	Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Стр.Сотрудник.ФизическоеЛицо, Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица);
		//	Адрес = СтрЗаменить(Адрес,"РОССИЯ,","");
		//	Адрес = СтрЗаменить(Адрес,"Воркутинский р-н,","");
		//	RegExp.Pattern = "<adres>(.|\n)*?<\/adres>"; 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<adres>"+Адрес+"</adres>");
		//	
		//	RegExp.Pattern = "<inn>(.|\n)*?<\/inn>"; 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<inn>"+Стр.Сотрудник.ФизическоеЛицо.ИНН+"</inn>");
		//	
		//	RegExp.Pattern = "<dolgnost>(.|\n)*?<\/dolgnost>"; // должность
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dolgnost>"+Стр.Должность+"</dolgnost>");
		//	
		//	RegExp.Pattern = "<dolg_vsego>(.|\n)*?<\/dolg_vsego>"; 
		//	Всего1 =  Стр.СуммаЗарплата + Стр.СуммаОтпуск;
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dolg_vsego>"+Всего1+"</dolg_vsego>");
		//	
		//	RegExp.Pattern = "<dolg_zarp>(.|\n)*?<\/dolg_zarp>"; 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dolg_zarp>"+Стр.СуммаЗарплата+"</dolg_zarp>");
		//	
		//	RegExp.Pattern = "<dolg_otp>(.|\n)*?<\/dolg_otp>"; 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dolg_otp>"+Стр.СуммаОтпуск+"</dolg_otp>");
		//	
		//	Если ВидЗарплаты = "Увольнения" Тогда
		//		ПериодДолга = "";
		//		ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп,15);
		//		RegExp.Pattern = "<dolg_uv>(.|\n)*?<\/dolg_uv>"; 
		//		СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<dolg_uv>"+Стр.СуммаЗарплата+"</dolg_uv>");
		//	ИначеЕсли ВидЗарплаты = "Аванс" или ЭтаФорма.ПоловинаМесяца = 1 Тогда
		//		Если Стр.СуммаЗарплата <> 0 Тогда
		//			ПериодДолга = "за первую половину " + МесяцЗарплаты + " " + Формат(ГодЗарплаты,"ЧГ=0") + " года";
		//			Если МесЗарп = 2 Тогда
		//				ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп,28);
		//			Иначе
		//				ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп,30);
		//			КонецЕсли;	
		//		Иначе
		//			ПериодДолга = "";
		//			ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп,15);
		//		КонецЕсли;
		//	Иначе
		//		Если Стр.СуммаЗарплата <> 0 Тогда
		//			ПериодДолга = "за вторую половину " + МесяцЗарплаты + " " + ГодЗарплаты + " года";
		//			ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп,15);
		//		Иначе
		//			ПериодДолга = "";
		//			ДатаВыплаты = Дата(ГодЗарплаты,МесЗарп,15);
		//		КонецЕсли
		//	КонецЕсли;	
		//	RegExp.Pattern = "<period_dolga>(.|\n)*?<\/period_dolga>"; 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<period_dolga>"+ПериодДолга+"</period_dolga>");
		//	Если ВидЗарплаты = "Увольнения" Тогда
		//		RegExp.Pattern = "<ne_uv>(.|\n)*?<\/ne_uv>"; 
		//		СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<ne_uv></ne_uv>");
		//	Иначе
		//		RegExp.Pattern = "<uv>(.|\n)*?<\/uv>"; 
		//		СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<uv></uv>");
		//	КонецЕсли;	
		//	RegExp.Pattern = "<predsed>(.|\n)*?<\/predsed>"; // 
		//	СтрТЗ.Документ = RegExp.Replace(СтрТЗ.Документ, "<predsed>"+ЭтаФорма.Председатель.Наименование+"</predsed>");
		КонецЕсли;
	КонецЦикла;
	//ЭтаФорма.Сотрудники.Сортировать("Подразделение,Сотрудник,Должность");
	//
	//ЭтаФорма.ПолеХТМЛ = "";
	//Для шаг = 0 По Объект.Печать.Количество()-1 Цикл
	//	Стр = Объект.Печать.Получить(шаг);
	//	ЭтаФорма.ПолеХТМЛ = ЭтаФорма.ПолеХТМЛ + Стр.Документ;
	//КонецЦикла;
	ТабДок.Вывести(Подвал);
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПечатьУдостоверений(Команда)
	ТД = ПечатьУдостоверенийНаСервере();
	ТД.Показать();
	Если ЭтаФорма.ПолеХТМЛ <> "" Тогда
		ЭтаФорма.ОбновитьОтображениеДанных(ЭтаФорма.Элементы.ПолеХТМЛ);
		ЭтаФорма.Элементы.ПолеХТМЛ.Документ.execCommand("Print");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПечатьПротоколаНаСервере(ТабДок)
	Со = Новый СообщениеПользователю;
	
	Кол1 = 1;
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботников1) Тогда
		Кол1 = Кол1 + 1;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботников2) Тогда
		Кол1 = Кол1 + 1;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботников3) Тогда
		Кол1 = Кол1 + 1;
	КонецЕсли;
	
	Кол2 = 0;
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботодателя1) Тогда
		Кол2 = Кол2 + 1;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботодателя2) Тогда
		Кол2 = Кол2 + 1;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботодателя3) Тогда
		Кол2 = Кол2 + 1;
	КонецЕсли;
	
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ТекОбъект.ПолучитьМакет("Протокол1");
	Ошапка = Макет.ПолучитьОбласть("шапка");
	Острока = Макет.ПолучитьОбласть("строка");
	Оподвал = Макет.ПолучитьОбласть("подвал");
	СокрН = Справочники.Организации.ОрганизацияПоУмолчанию().НаименованиеСокращенное;
	Ошапка.Параметры.Орг = Справочники.Организации.ОрганизацияПоУмолчанию().НаименованиеПолное;
	Ошапка.Параметры.Орг1 = Справочники.Организации.ОрганизацияПоУмолчанию().НаименованиеПолное;
	Ошапка.Параметры.АдресОрганизации = ПолучитьАдресОрганизации();
	Ошапка.Параметры.АдресОрганизации1 = ПолучитьАдресОрганизации();
	Ошапка.Параметры.ДатаРешения = Формат(ЭтаФорма.РешениеДата,"ДЛФ=Д");
	Ошапка.Параметры.Далее = "(далее - " + СокрН + ")";
	Ошапка.Параметры.ПредстРаботниковК = "Представители работников – " + Строка(Кол1) + " (" + Сред(ЧислоПрописью(Кол1,"Л=ru_RU; ДП=Ложь"),1,3) + ") человек";
	Ошапка.Параметры.ПредстРаботодателяК = "Представители работодателя – " + Строка(Кол2) + " (" + Сред(ЧислоПрописью(Кол2,"Л=ru_RU; ДП=Истина"),1,3) + ") человек";
	//ЧислоПрописью(1234.56, "Л=ru_RU;ДП=Истина", "целая, целых, целых, ж, сотая, сотой, сотых, ж, 2");
	//Результат: Одна тысяча двести тридцать четыре целых пятьдесят шесть сотых	
	Ошапка.Параметры.Председатель = "Председатель Комиссии: " + ЭтаФорма.Председатель.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.Председатель.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.Председатель.ФизическоеЛицо.Отчество,1,1) + ". ";
	ПредстРаботников = "";
	П1 = "представители работников: ";
	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботников1) Тогда
		ПредстРаботников = ПредстРаботников + ЭтаФорма.ПредставительРаботников1.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботников1.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботников1.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботников2) Тогда
		ПредстРаботников = ПредстРаботников + ", " + ЭтаФорма.ПредставительРаботников2.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботников2.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботников2.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботников3) Тогда
		ПредстРаботников = ПредстРаботников + ", " + ЭтаФорма.ПредставительРаботников3.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботников3.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботников3.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;
	Ошапка.Параметры.ПредстРаботников = П1 + ПредстРаботников;
	ПредстРаботодателя = "";
	П1 = "представители работодателя: ";
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботодателя1) Тогда
		ПредстРаботодателя = ПредстРаботодателя + ЭтаФорма.ПредставительРаботодателя1.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботодателя1.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботодателя1.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботодателя2) Тогда
		ПредстРаботодателя = ПредстРаботодателя + ", " + ЭтаФорма.ПредставительРаботодателя2.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботодателя2.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботодателя2.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботодателя3) Тогда
		ПредстРаботодателя = ПредстРаботодателя + ", " + ЭтаФорма.ПредставительРаботодателя3.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботодателя3.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботодателя3.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;
	Ошапка.Параметры.ПредстРаботодателя = П1 + ПредстРаботодателя;	
	ДатаРешения = Формат(ЭтаФорма.РешениеДата,"ДЛФ=Д");
	ПовесткаДня = ПодчеркнутьТекстВМакете("Повестка дня");
	ОШапка.Параметры.Повестка = ПовесткаДня + ": рассмотрение заявлений от " + ДатаРешения + " о задолженности по заработной плате, задолженности оплаты отпуска, задолженности по выплате окончательного расчета при увольнении, поступивших в Комиссию от следующих работников " + СокрН + ":";
	
	ТабДок.Вывести(Ошапка);
	//ЭтаФорма.Сотрудники.Сортировать("ПорПеч,Подразделение,Сотрудник,Должность");
	Если ЭтаФорма.СписокПоУбыванию Тогда
		ЭтаФорма.Сотрудники.Сортировать("ПорПеч,Сотрудник УБЫВ,Должность");
	Иначе	
		ЭтаФорма.Сотрудники.Сортировать("ПорПеч,Сотрудник,Должность");
	КонецЕсли;	
	Нпп = 0;
	Для шаг = 0 По ЭтаФорма.Сотрудники.Количество()-1 Цикл
		Стр = ЭтаФорма.Сотрудники.Получить(шаг);
		Нпп = Нпп + 1;
		Острока.Параметры.Нпп = Нпп;
		Острока.Параметры.ФИО = Стр.Сотрудник.Наименование;
		Острока.Параметры.Должность = Стр.Должность;
		Острока.Параметры.Сумма = Стр.СуммаЗарплата + Стр.СуммаОтпуск;
		ТабДок.Вывести(ОСтрока);
	КонецЦикла;	
	Слушали = ПодчеркнутьТекстВМакете("Слушали");
	Оподвал.Параметры.Слушали = Слушали + ": ХХХХХХ Х.Х. по вопросу массовой подачи Работниками в Комиссию заявлений о нарушении " + СокрН + "сроков выплаты заработной платы работникам, выплаты окончательного расчета при увольнении. Выплата Работникам до настоящего времени не произведена. С учетом сроков оплаты допущенная " + СокрН + " задержка нарушает права Работников. Заявления зачитаны вслух.";
	Выступили = ПодчеркнутьТекстВМакете("Выступили");
	Оподвал.Параметры.Выступили = Выступили + ": ХХХХХХ Х.Х., который подтвердила факт наличия задолженности перед Работниками в размере, указанном в заявлениях, а также сообщил, что по запросу Комиссии со стороны " + СокрН + " для обозрения были представлены реестры начисления заработной платы, выплаты окончательного расчета при увольнении, трудовые договоры, Положение об оплате труда работников " + СокрН + Символы.ПС + ". ХХХХХХ Х.Х., которая подтвердила правомерность предъявленных требований с учетом положений действующего трудового законодательства и локальных нормативных актов " + СокрН + ".";
	Всего = ЭтаФорма.Сотрудники.Итог("СуммаЗарплата")+ЭтаФорма.Сотрудники.Итог("СуммаОтпуск");
	СуммаВРублях = Строка(Цел(ЭтаФорма.Сотрудники.Итог("СуммаЗарплата")+ЭтаФорма.Сотрудники.Итог("СуммаОтпуск"))) + " руб. " + Строка((ЭтаФорма.Сотрудники.Итог("СуммаЗарплата")+ЭтаФорма.Сотрудники.Итог("СуммаОтпуск")-Цел(ЭтаФорма.Сотрудники.Итог("СуммаЗарплата")+ЭтаФорма.Сотрудники.Итог("СуммаОтпуск")))*100) + " коп.";
	ОПодвал.Параметры.Результат = "С учетом конкретных обстоятельств спора и представленных со стороны " + СокрН + " документов и информации, руководствуясь статьями 136, 140,387,388,389 Трудового кодекса Российской Федерации, Комиссия признала требования Работников обоснованными и подлежащими удовлетворению в заявленном ими размере. Общий размер требований Работников, подлежащих удовлетворению, составляет " + СуммаВРублях;
	
	ОПодвал.Параметры.Председатель1 = ЭтаФорма.Председатель.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.Председатель.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.Председатель.ФизическоеЛицо.Отчество,1,1) + ". ";
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботников1) Тогда
		ОПодвал.Параметры.Чел1 = ЭтаФорма.ПредставительРаботников1.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботников1.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботников1.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботников2) Тогда
		ОПодвал.Параметры.Чел2 = ЭтаФорма.ПредставительРаботников2.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботников2.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботников2.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботников3) Тогда
		ОПодвал.Параметры.Чел3 = ЭтаФорма.ПредставительРаботников2.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботников3.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботников3.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботодателя1) Тогда
		ОПодвал.Параметры.Чел4 = ЭтаФорма.ПредставительРаботодателя1.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботодателя1.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботодателя1.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботодателя2) Тогда
		ОПодвал.Параметры.Чел5 = ЭтаФорма.ПредставительРаботодателя2.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботодателя2.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботодателя2.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭтаФорма.ПредставительРаботодателя3) Тогда
		ОПодвал.Параметры.Чел6 = ЭтаФорма.ПредставительРаботодателя3.ФизическоеЛицо.Фамилия + " " + Сред(ЭтаФорма.ПредставительРаботодателя3.ФизическоеЛицо.Имя,1,1) + ". " + Сред(ЭтаФорма.ПредставительРаботодателя3.ФизическоеЛицо.Отчество,1,1) + ". ";
	КонецЕсли;
	//ОПодвал.Параметры.СуммаВРублях = Строка(Цел(ЭтаФорма.Сотрудники.Итог("СуммаЗарплата")+ЭтаФорма.Сотрудники.Итог("СуммаОтпуск"))) + " руб. " + Строка((ЭтаФорма.Сотрудники.Итог("СуммаЗарплата")+ЭтаФорма.Сотрудники.Итог("СуммаОтпуск")-Цел(ЭтаФорма.Сотрудники.Итог("СуммаЗарплата")+ЭтаФорма.Сотрудники.Итог("СуммаОтпуск")))*100) + " коп.";
	ЭтаФорма.Сотрудники.Сортировать("Подразделение,Сотрудник,Должность");
	ТабДок.Вывести(ОПодвал);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПротокола(Команда)
	ТабДок = новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ПечатьПротоколаНаСервере(ТабДок);
	ИдентификаторПечатнойФормы = "ПротоколКТС";
	НазваниеПечатнойФормы = НСтр("ru = 'ПротоколКТС'");
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		ТабДок.Показать(НазваниеПечатнойФормы);
		Возврат;
	КонецЕсли;
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ОткрытьШаблон("ЗаявлениеКТС");
	RegExp = Новый COMОбъект("VBScript.RegExp"); // создаем объект для работы с регулярными выражениями
	RegExp.MultiLine = Истина;  // истина — текст многострочный, ложь — одна строка
	RegExp.Global = Истина;     // истина — поиск по всей строке, ложь — до первого совпадения
	RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске
	Отпуск = Истина;
	//ПриОткрытииНаСервере();
	Если ЭтаФорма.ПоловинаМесяца = "" или ЭтаФорма.ПоловинаМесяца = 2 Тогда
		ЭтаФорма.ПоловинаМесяца = 1;
	Иначе
		ЭтаФорма.ПоловинаМесяца = 2;
	КонецЕсли;	
	ЭтаФорма.Сотрудники.Сортировать("Подразделение,Сотрудник,Должность");
	ЭтаФорма.Зарплата = ЭтаФорма.Сотрудники.Итог("СуммаЗарплата");
	ЭтаФорма.Отпуск = ЭтаФорма.Сотрудники.Итог("СуммаОтпуск");
	ЭтаФорма.Всего = ЭтаФорма.Сотрудники.Итог("СуммаЗарплата") + ЭтаФорма.Сотрудники.Итог("СуммаОтпуск");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокумента(Команда)
	// Вставить содержимое обработчика.
	Если ЭтаФорма.ПолеХТМЛ <> "" Тогда
		ЭтаФорма.Элементы.ПолеХТМЛ.Документ.execCommand("Print");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	//ЭтаФорма.ОбновитьОтображениеДанных(ЭтаФорма.Элементы.Всего);
	//ЭтаФорма.ОбновитьОтображениеДанных(ЭтаФорма.Элементы.Отпуск);
	//ЭтаФорма.ОбновитьОтображениеДанных(ЭтаФорма.Элементы.Зарплата);
	ЭтаФорма.Зарплата = ЭтаФорма.Сотрудники.Итог("СуммаЗарплата");
	ЭтаФорма.Отпуск = ЭтаФорма.Сотрудники.Итог("СуммаОтпуск");
	ЭтаФорма.Всего = ЭтаФорма.Сотрудники.Итог("СуммаЗарплата") + ЭтаФорма.Сотрудники.Итог("СуммаОтпуск");
	
КонецПроцедуры

&НаСервере
Процедура ПечатьРеестраНаСервере(ТабДок)
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ТекОбъект.ПолучитьМакет("Реестр");
	Ошапка = Макет.ПолучитьОбласть("шапка");
	Острока = Макет.ПолучитьОбласть("строка");
	Оподвал = Макет.ПолучитьОбласть("подвал");
	Ошапка.Параметры.Орг = Справочники.Организации.ОрганизацияПоУмолчанию().НаименованиеПолное;
	Ошапка.Параметры.Решение = "Решение № " + ЭтаФорма.РешениеНомер + " от " +Формат(ЭтаФорма.РешениеДата,"ДЛФ=Д") + ".";
	ТабДок.Вывести(Ошапка);
	Если ЭтаФорма.СписокПоУбыванию Тогда
		ЭтаФорма.Сотрудники.Сортировать("ПорПеч,Сотрудник УБЫВ,Должность");
	Иначе	
		ЭтаФорма.Сотрудники.Сортировать("ПорПеч,Сотрудник,Должность");
	КонецЕсли;	
	Нпп = 0;
	Для шаг = 0 По ЭтаФорма.Сотрудники.Количество()-1 Цикл
		Стр = ЭтаФорма.Сотрудники.Получить(шаг);
		Нпп = Нпп + 1;
		Острока.Параметры.УКТС = Стр.НомерУдостоверения;
		Острока.Параметры.ФИО = Стр.Сотрудник.Наименование;
		Острока.Параметры.СчетПолучателя = Стр.ЛицевойСчет;
		Острока.Параметры.БикБанка = Стр.Банк.Код;
		Острока.Параметры.Всего = Стр.СуммаЗарплата + Стр.СуммаОтпуск;
		ТабДок.Вывести(ОСтрока);
	КонецЦикла;	
	Оподвал.Параметры.ВсегоИтог = ЭтаФорма.Сотрудники.Итог("СуммаЗарплата")+ЭтаФорма.Сотрудники.Итог("СуммаОтпуск");
	ЭтаФорма.Сотрудники.Сортировать("Подразделение,Сотрудник,Должность");
	ТабДок.Вывести(ОПодвал);
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРеестра(Команда)
	ТабДок = новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ПечатьРеестраНаСервере(ТабДок);
	ИдентификаторПечатнойФормы = "РеестрКТС";
	НазваниеПечатнойФормы = НСтр("ru = 'РеестрКТС'");
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		ТабДок.Показать(НазваниеПечатнойФормы);
		Возврат;
	КонецЕсли;
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПорПечПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	инд = ЭтаФорма.Сотрудники.Индекс(ЭтаФорма.Элементы.Сотрудники.ТекущиеДанные);
	СтрСотр = ЭтаФорма.Сотрудники.Получить(инд);
КонецПроцедуры

&НаКлиенте
Процедура ПолМес(Команда)
	// Вставить содержимое обработчика.
	Если ЭтаФорма.ПоловинаМесяца = "" или ЭтаФорма.ПоловинаМесяца = 2 Тогда
		ЭтаФорма.ПоловинаМесяца = 1;
	Иначе
		ЭтаФорма.ПоловинаМесяца = 2;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОтметкаВсеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	инд = ЭтаФорма.Сотрудники.Индекс(ЭтаФорма.Элементы.Сотрудники.ТекущиеДанные);
	СтрСотр = ЭтаФорма.Сотрудники.Получить(инд);
	ЗнОтм = СтрСотр.ОтметкаВсе;
	Для шаг = 0 По ЭтаФорма.Сотрудники.Количество()-1 Цикл
		Стр = ЭтаФорма.Сотрудники.Получить(шаг);
		Стр.ОтметкаСотрудник = Ложь;
		Стр.ОтметкаПодразделение = Ложь;
		Стр.ОтметкаВсе = ЗнОтм;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявленияВКТС(Команда)
	// Вставить содержимое обработчика.
	ПечатьЗаявленийНаСервере(1);
	ЭтаФорма.ОбновитьОтображениеДанных(ЭтаФорма.Элементы.ПолеХТМЛ);
	ЭтаФорма.Элементы.ПолеХТМЛ.Документ.execCommand("Print");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявленийВБанк(Команда)
	// Вставить содержимое обработчика.
	ПечатьЗаявленийНаСервере(2);
	ЭтаФорма.ОбновитьОтображениеДанных(ЭтаФорма.Элементы.ПолеХТМЛ);
	ЭтаФорма.Элементы.ПолеХТМЛ.Документ.execCommand("Print");
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаявленияНаОтзывНаСервере(ТабДок)
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ТекОбъект.ПолучитьМакет("ЗаявлениеОбОтзыве");
	МакетДов = ТекОбъект.ПолучитьМакет("Доверенность");
	Для шаг = 0 По ЭтаФорма.Сотрудники.Количество()-1 Цикл
		Стр = ЭтаФорма.Сотрудники.Получить(шаг);
		ФЛ = Стр.Сотрудник.ФизическоеЛицо;
		Если Стр.ОтметкаСотрудник или Стр.ОтметкаПодразделение или Стр.ОтметкаВсе Тогда
			Ошапка = Макет.ПолучитьОбласть("Заявление");
			//Ошапка.Параметры.ДатаРешения = Формат(ЭтаФорма.РешениеДата,"ДЛФ=Д");
			Ошапка.Параметры.Сотрудник = Стр.Сотрудник;
			Ошапка.Параметры.ИНН = ФЛ.ИНН;
			ФЛ = Стр.Сотрудник.ФизическоеЛицо;
			Пол = 1;
			Если ФЛ.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				Пол = 2;
			КонецЕсли;	
			ФИОПолноеРодПадеж = СклонениеПредставленийОбъектов.ПросклонятьФИО(Стр.Сотрудник.Наименование, 2, Стр.Сотрудник, Пол);
			Ошапка.Параметры.Сотрудника = ФИОПолноеРодПадеж;
			Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФЛ, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
			Адрес = СтрЗаменить(Адрес,"РОССИЯ,","");
			Адрес = СтрЗаменить(Адрес,"Воркутинский р-н,","");
			Ошапка.Параметры.Адрес = Адрес;
			Телефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФЛ, Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
			Ошапка.Параметры.Телефон = Телефон;
			ЭлПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФЛ, Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
			Ошапка.Параметры.ЭлПочта = ЭлПочта;
			ДанныеФизЛица = КадровыйУчет.ДокументыФизическихЛиц(ФЛ, Истина); 
			Серия = ДанныеФизЛица[0].Серия;	
			Номер = ДанныеФизЛица[0].Номер;	
			Выдан = ДанныеФизЛица[0].КемВыдан;	
			ДатаВыдачи = ДанныеФизЛица[0].ДатаВыдачи;	
			ПредставлениеДокумента = "Серия "+Серия+" № "+Номер;
			ПредставлениеДокументаВыдан = "выдан "+Выдан+" "+Формат(ДатаВыдачи,"ДЛФ=Д")+" г.";
			Ошапка.Параметры.ПредставлениеДокумента = ПредставлениеДокумента;
			Ошапка.Параметры.ПредставлениеДокументаВыдан = ПредставлениеДокументаВыдан;
			Ошапка.Параметры.НомерУдостоверения = Стр.НомерУдостоверения;
			Ошапка.Параметры.ДатаВыдачиУдостоверения = Формат(ЭтаФорма.УдостоверениеДата,"ДЛФ=Д")+" г.";
			Ошапка.Параметры.Организация = Справочники.Организации.ОрганизацияПоУмолчанию().НаименованиеПолное;
			Ошапка.Параметры.НомерРешения = ЭтаФорма.РешениеНомер;
			Ошапка.Параметры.ДатаРешения = Формат(ЭтаФорма.РешениеДата,"ДЛФ=Д")+" г.";
			
			ТабДок.Вывести(Ошапка);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();			
			Если Стр.СДоверенностью Тогда
				ИННорг = Справочники.Организации.ОрганизацияПоУмолчанию().ИНН;
				ОГРНорг = Справочники.Организации.ОрганизацияПоУмолчанию().ОГРН;
				ОДов = МакетДов.ПолучитьОбласть("Доверенность");
				ОДов.Параметры.Сотрудник = Стр.Сотрудник;
				Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФЛ, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
				Адрес = СтрЗаменить(Адрес,"РОССИЯ,","");
				Адрес = СтрЗаменить(Адрес,"Воркутинский р-н,","");
				ОДов.Параметры.Адрес = Адрес;
				ОДов.Параметры.НомерРешения = ЭтаФорма.РешениеНомер;
				ОДов.Параметры.ИННОрг = ИННОрг;
				ОДов.Параметры.ОГРНОрг = ОГРНОрг;
				ОДов.Параметры.ДатаРешения = Формат(ЭтаФорма.РешениеДата,"ДЛФ=Д")+" г.";
				ОДов.Параметры.НомерУдостоверения = Стр.НомерУдостоверения;
				ОДов.Параметры.ДатаВыдачиУдостоверения = Формат(ЭтаФорма.УдостоверениеДата,"ДЛФ=Д")+" г.";
				ОДов.Параметры.Организация = Справочники.Организации.ОрганизацияПоУмолчанию().НаименованиеПолное;
				ОДов.Параметры.ПредставлениеДокумента = ПредставлениеДокумента;
				ОДов.Параметры.ПредставлениеДокументаВыдан = ПредставлениеДокументаВыдан;
				ОДов.Параметры.ДатаДействия = Формат(Стр.ОкончаниеСрокаДоверенности,"ДЛФ=Д")+" г.";
                ОДов.Параметры.ДатаДоверенности = Формат(ТекущаяДата(),"ДЛФ=Д")+" г.";
				ТабДок.Вывести(ОДов);
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();			
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявленияНаОтзыв(Команда)
	ТабДок = новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ПечатьЗаявленияНаОтзывНаСервере(ТабДок);
	ИдентификаторПечатнойФормы = "ЗаявлениеОбОтзыве";
	НазваниеПечатнойФормы = НСтр("ru = 'ЗаявлениеОбОтзыве'");
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		ТабДок.Показать(НазваниеПечатнойФормы);
		Возврат;
	КонецЕсли;
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	//	ПечатьЗаявленияНаОтзывНаСервере();
КонецПроцедуры
