Функция ФамилияИнициалыФизЛица(Объект = "", Фамилия = " ", Имя = " ", Отчество = " ") Экспорт

ТипОбъекта = ТипЗнч(Объект);
Если ТипОбъекта = Тип("Строка") Тогда
ФИО = РазложитьСтрокуВМассивПодстрок(СокрЛП(Объект)," ");
ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ФизическиеЛица") или ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") Тогда 
ФИО = РазложитьСтрокуВМассивПодстрок(СокрЛП(Объект.Наименование)," ");
Иначе

// используем возможно переданные отдельные строки
Возврат ?(НЕ ПустаяСтрока(Фамилия), 
Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""),
"")
КонецЕсли;

КоличествоПодстрок = ФИО.Количество();
Фамилия = ?(КоличествоПодстрок > 0,ФИО[0],"");
Имя        = ?(КоличествоПодстрок > 1,ФИО[1],"");
Отчество= ?(КоличествоПодстрок > 2,ФИО[2],"");

Возврат ?(НЕ ПустаяСтрока(Фамилия), 
Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""),
"");

КонецФункции
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",",
    Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
 
    Результат = Новый Массив;
 
    // для обеспечения обратной совместимости
    Если ПропускатьПустыеСтроки = Неопределено Тогда
        ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
        Если ПустаяСтрока(Строка) Тогда 
            Если Разделитель = " " Тогда
                Результат.Добавить("");
            КонецЕсли;
            Возврат Результат;
        КонецЕсли;
    КонецЕсли;
    //
 
    Позиция = Найти(Строка, Разделитель);
    Пока Позиция > 0 Цикл
        Подстрока = Лев(Строка, Позиция - 1);
        Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
            Результат.Добавить(Подстрока);
        КонецЕсли;
        Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
        Позиция = Найти(Строка, Разделитель);
    КонецЦикла;
 
    Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
        Результат.Добавить(Строка);
    КонецЕсли;
 
    Возврат Результат;
 
КонецФункции
Функция Год1(Год)
	Если Год = 2017 Тогда
		Возврат "2017";
	ИначеЕсли Год = 2018 Тогда	
		Возврат "2018";
	ИначеЕсли Год = 2018 Тогда	
		Возврат "2018";
	ИначеЕсли Год = 2019 Тогда	
		Возврат "2019";
	ИначеЕсли Год = 2020 Тогда	
		Возврат "2020";
	Иначе
		Возврат Строка(Год);
	КонецЕсли;	
КонецФункции	

Функция МесНаим(НомМес)
	Если НомМес = 1 Тогда
		возврат "январь";
	ИначеЕсли НомМес = 2 Тогда	
		возврат "февраль";
	ИначеЕсли НомМес = 3 Тогда	
		возврат "март";
	ИначеЕсли НомМес = 4 Тогда	
		возврат "апрель";
	ИначеЕсли НомМес = 5 Тогда	
		возврат "май";
	ИначеЕсли НомМес = 6 Тогда	
		возврат "июнь";
	ИначеЕсли НомМес = 7 Тогда	
		возврат "июль";
	ИначеЕсли НомМес = 8 Тогда	
		возврат "август";
	ИначеЕсли НомМес = 9 Тогда	
		возврат "сентябрь";
	ИначеЕсли НомМес = 10 Тогда	
		возврат "октябрь";
	ИначеЕсли НомМес = 11 Тогда	
		возврат "ноябрь";
	ИначеЕсли НомМес = 12 Тогда	
		возврат "декабрь";
	КонецЕсли;	
КонецФункции	

Функция ПолучитьТаблицуКоманд()

    Команды = Новый ТаблицаЗначений;
    //как будет выглядеть описание печ.формы для пользователя
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
    //имя макета печ.формы
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
    //ВызовСерверногоМетода
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));

    Возврат Команды;
КонецФункции

Функция ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда. Представление = Представление;
    НоваяКоманда. Идентификатор= Идентификатор;
    НоваяКоманда. Использование= Использование;
    НоваяКоманда. ПоказыватьОповещение= ПоказыватьОповещение;
    НоваяКоманда. Модификатор= Модификатор;

КонецФункции

Функция УказатьНаименованиеКомандыПечати()
    Наименование = ЭтотОбъект.Метаданные().ПолноеИмя();
    Возврат Наименование;
КонецФункции

Функция УказатьНаименованиеВнешнейПечатнойФормы()

    Наименование = ЭтотОбъект.Метаданные().Представление();
    Возврат Наименование;

КонецФункции

Функция ПолучитьМетаданныеДокументаПечати()

    ПолноеИмя = Документ.Метаданные().ПолноеИмя();
    Возврат ПолноеИмя;

КонецФункции

Функция ПечатьФормы(МассивОбъектов)
	
	ТекДок = новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	Для Каждого СсылкаНаОбъект из МассивОбъектов Цикл
		
		
		Сообщение = Новый СообщениеПользователю;
		
		ВыбИмяФайла = СокрЛП(Константы.ПутьКПапкеШаблонов.Получить())+"\ТРУДОВОЙ ДОГОВОР ЖЭКИ.docx";
		СохрИмяФайла = СокрЛП(Константы.ПутьКПапкеШаблонов.Получить())+"\ТД "+СокрЛП(ССылкаНаОбъект.Сотрудник.Наименование) + ".docx";
		Word = новый COMОбъект("Word.Application");
		Docs=Word.Documents;
		Word.Visible=1;
		Сообщение.Текст = ВыбИмяФайла;
	    Сообщение.Сообщить();
 
		Doc=Docs.Add(ВыбИмяФайла);
		BMs=Doc.Bookmarks;
		//СсылкаНаОбъект = Документы.ПриемНаРаботу.СоздатьДокумент();
		СЗ = Новый СписокЗначений;
		СЗ.Добавить(Врег(СсылкаНаОбъект.Сотрудник.Наименование),"ВрегФИО");
		СЗ.Добавить(СсылкаНаОбъект.Сотрудник.Наименование,"ФИО_Оконч");
		СЗ.Добавить("ИНН " + СсылкаНаОбъект.Сотрудник.ФизическоеЛицо.ИНН,"ИННРаботника");
		СЗ.Добавить("СНИЛС " + СсылкаНаОбъект.Сотрудник.ФизическоеЛицо.СтраховойНомерПФР,"СНИЛС");
		СЗ.Добавить(СсылкаНаОбъект.Сотрудник.Код,"ТабНомер");
		СЗ.Добавить(Формат(СсылкаНаОбъект.Дата,"ДЛФ=Д"),"ДатаДок");
		СЗ.Добавить(СсылкаНаОбъект.Организация.НаименованиеПолное,"НаимОрг");
		СЗ.Добавить(СсылкаНаОбъект.Организация.НаименованиеПолное,"МестоРаботы");
		СЗ.Добавить(СсылкаНаОбъект.Организация.НаименованиеПолное,"ПолНаимОрг");
		СЗ.Добавить(СсылкаНаОбъект.Организация.НаименованиеПолное,"ПолнНаимРекв");
		СЗ.Добавить("ИНН "+СокрЛП(СсылкаНаОбъект.Организация.ИНН)+" / КПП "+СокрЛП(СсылкаНаОбъект.Организация.РегистрацияВНалоговомОргане.КПП),"ИННКПП");
		Адрес = СсылкаНаОбъект.Организация.КонтактнаяИнформация.Получить(0).Представление;
		СЗ.Добавить(Адрес,"АдресРекв");
		Адр = СсылкаНаОбъект.Организация.КонтактнаяИнформация.Получить(1).Представление;
		СЗ.Добавить(Адр,"АдресОрг");
		СЗ.Добавить(СсылкаНаОбъект.Организация.НаименованиеСокращенное,"НаимСокрРекв");
		СЗ.Добавить(СсылкаНаОбъект.Организация.НаименованиеСокращенное,"СокрНаимОрг");
		СЗ.Добавить(СсылкаНаОбъект.Организация.НаименованиеСокращенное,"СокрНаимОрг1");
		СЗ.Добавить(СсылкаНаОбъект.Организация.НаименованиеСокращенное,"СокрНаимОрг2");
		СЗ.Добавить(СсылкаНаОбъект.Организация.НаименованиеСокращенное,"СокрНаимОрг3");
		СклоненияНЗ = РегистрыСведений.СклоненияПредставленийОбъектов.СоздатьНаборЗаписей();
		СклоненияНЗ.Прочитать();
		НашеФИО = СсылкаНаОбъект.Руководитель.Наименование;
		Для шаг = 1 По СклоненияНЗ.Количество() Цикл
			СтрСкл = СклоненияНЗ.Получить(шаг - 1);
			Если СтрСкл.Объект = СсылкаНаОбъект.Руководитель Тогда
				НашеФИО = Врег(СтрСкл.РодительныйПадеж);
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		СЗ.Добавить(НашеФИО,"ДиректорКого");
		СЗ.Добавить(ФамилияИнициалыФизЛица(СсылкаНаОбъект.Руководитель.Наименование),"ДиректорСокр");
		Если СсылкаНаОбъект.Руководитель.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			СЗ.Добавить("й","ДирПар1");
			СЗ.Добавить("ой","ДирПар2");
		Иначе
			СЗ.Добавить("го","ДирПар1");
			СЗ.Добавить("ого","ДирПар2");
		КонецЕсли;	
		Если СсылкаНаОбъект.Сотрудник.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			СЗ.Добавить("ная","СотрПар1");
			СЗ.Добавить("ая","СотрПар2");
			СЗ.Добавить("ая","СотрПар3");
			СЗ.Добавить("гражданка","ТипГражданина");
			Сз.Добавить("36","ПродолжитДня");
		Иначе
			СЗ.Добавить("ный","СотрПар1");
			СЗ.Добавить("ий","СотрПар2");
			СЗ.Добавить("ый","СотрПар3");
			СЗ.Добавить("гражданин","ТипГражданина");
			Сз.Добавить("40","ПродолжитДня");
		КонецЕсли;
		Если Найти(СсылкаНаОбъект.УсловияПриема,"Аварийно-диспетчерская служба") > 0 Тогда
			СЗ.Добавить("(в порядке перевода из ООО ""Аварийно-диспетчерская служба"")","ВПорядкеПеревода");
		Иначе
			СЗ.Добавить("","ВПорядкеПеревода");
		КонецЕсли;	
		ДокументыНЗ = РегистрыСведений.ДокументыФизическихЛиц.СоздатьНаборЗаписей();
		ДокументыНЗ.Прочитать();
		Паспорт = "";
		//Для шаг = 1 По ДокументыНЗ.Количество() Цикл
		//	СтрСкл = ДокументыНЗ.Получить(шаг - 1);
		//	Если СтрСкл.Физлицо = СсылкаНаОбъект.Сотрудник.ФизическоеЛицо Тогда
		//		Паспорт = СтрСкл.ВидДокумента.Наименование + " серия " + СтрСкл.Серия + " № " + СтрСкл.Номер + ", выданный " + СтрСкл.КемВыдан + " " + Формат(СтрСкл.ДатаВыдачи,"ДЛФ=Д");
		//		Прервать;
		//	КонецЕсли;	
		//КонецЦикла;	
		ДанныеФизЛица = КадровыйУчет.ДокументыФизическихЛиц(СсылкаНаОбъект.ФизическоеЛицо, Истина, Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ, ТекущаяДата());
		Попытка
		Паспорт = "" + ДанныеФизЛица[0].ВидДокумента + " серия " 
			+ ДанныеФизЛица[0].Серия + " № " + ДанныеФизЛица[0].Номер + " выданный " + ДанныеФизЛица[0].КемВыдан + " " + Формат(ДанныеФизЛица[0].ДатаВыдачи,"ДЛФ=Д");
		Исключение
			Паспорт = "нет паспорта РФ";
		КонецПопытки;
		СЗ.Добавить(Паспорт,"паспорт2");
		СЗ.Добавить(Паспорт,"паспорт");
		Регистрация = "";
		ТабКИ = СсылкаНаОбъект.Сотрудник.ФизическоеЛицо.КонтактнаяИнформация;
		Для шаг = 1 по ТабКИ.Количество() Цикл
			СтрКИ = ТабКИ.Получить(шаг - 1);
			Если СокрЛП(СтрКИ.Вид.Наименование) = "Адрес по прописке" Тогда
				Регистрация = СтрКИ.Представление;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		СЗ.Добавить(Регистрация,"Регистрация");
		СЗ.Добавить(СсылкаНаОбъект.Подразделение.Наименование,"Подразделение");
		СЗ.Добавить("г. Воркута " + Справочники.Организации.ОрганизацияПоУмолчанию().НаименованиеСокращенное,"МестоРаботы");
		СЗ.Добавить(СсылкаНаОбъект.Должность.Наименование + " " + СсылкаНаОбъект.Должность.РазрядКатегория.Наименование,"Должность");
		Если СсылкаНаОбъект.ВидЗанятости = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы Тогда
			Совм = "основным местом работы";
		Иначе
			Совм = "совместительством";
		КонецЕсли;	
		СЗ.Добавить(Совм,"Совместит");
		ДатаНачала = СсылкаНаОбъект.ДатаПриема;
		Если Не ЗначениеЗаполнено(СсылкаНаОбъект.ДатаЗавершенияТрудовогоДоговора) Тогда
			ПериодДоговора = "на неопределенный срок";
		Иначе
			ПериодДоговора = "временно";
			ДатаОкончания = СсылкаНаОбъект.ДатаЗавершенияТрудовогоДоговора;
			СЗ.Добавить(Формат(ДатаОкончания,"ДЛФ=Д"),"ДатаОкончания");
		КонецЕсли;	
		СЗ.Добавить(ПериодДоговора,"ПериодДоговора");
		СЗ.Добавить(Формат(ДатаНачала,"ДЛФ=Д"),"ДатаНачала");
		//ФразаКласс = "";
		//НЗ_Классы = РегистрыСведений.КлассыУсловийТрудаПоДолжностям.СоздатьНаборЗаписей();
		//НЗ_Классы.Прочитать();
		//Для шаг = 1 По НЗ_Классы.Количество() Цикл
		//	СтрКлассы = НЗ_Классы.Получить(шаг - 1);
		//	Если СтрКлассы.Должность = СсылкаНаОбъект.ДолжностьПоШтатномуРасписанию.Должность Тогда
		//		Класс = СтрКлассы.КлассУсловийТруда;
		//	КонецЕсли;	
		//КонецЦикла;
		//Если Класс = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1 Тогда
		//	ФразаКласс = "вредными условиями труда (класс 3.1)";	
		//ИначеЕсли Класс = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2 Тогда
		//	ФразаКласс = "вредными условиями труда (класс 3.2)";	
		//ИначеЕсли Класс = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый Тогда
		//	ФразаКласс = "допустимыми условиями труда (класс 2)";	
		//КонецЕсли;	
		//СЗ.Добавить(ФразаКласс,"Класс");
		СЗ.Добавить(СокрП(СсылкаНаОбъект.Должность.Наименование),"Должность1");
		СтрСмыв = "";
		ВыбСмыв = Справочники.НормаВыдСмСрНаДолж.Выбрать(,СсылкаНаОбъект.Должность);
		Пока ВыбСмыв.Следующий() Цикл
			Если не ВыбСмыв.ПометкаУдаления Тогда
				СтрСмыв = СтрСмыв + СокрЛП(ВыбСмыв.СтрокаНормы.Наименование) + Символы.ПС;
			КонецЕсли;	
		КонецЦикла;
		СЗ.Добавить(СтрСмыв,"СмывСр");
		//Если СсылкаНаОбъект.ДлительностьИспытательногоСрока <> 0 Тогда
		//	П1_6 = "1.6. Работнику устанавливается испытание при приеме на работу в целях проверки его соответствия поручаемой"+Символы.ПС+
		//	" работе. Срок испытания - 3 (три) месяца со дня фактического начала работы. В срок испытания не включаются периоды,"+Символы.ПС+
		//	" когда Работник фактически отсутствовал на работе." + Символы.ПС+
		//	"       Критериями успешного прохождения испытания является полное, качественное и своевременное выполнение"+Символы.ПС+
		//	" Работником трудовой функции, предусмотренной настоящим трудовым договором и должностной инструкцией, приказов"+Символы.ПС+
		//	" (распоряжений) Работодателя, распоряжений непосредственного руководителя, действующих в организации локальных"+Символы.ПС+
		//	" нормативных актов и требований к работе, трудовой дисциплины, положений охраны труда и техники безопасности.";
		//Иначе
		//	П1_6 = "";
		//КонецЕсли;	
		//СЗ.Добавить(П1_6,"Пункт1_6");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеНачисления.Регистратор КАК Регистратор,
		|	ПлановыеНачисления.Активность КАК Активность,
		|	ПлановыеНачисления.Сотрудник.Ссылка КАК СотрудникСсылка,
		|	ПлановыеНачисления.Начисление.Ссылка КАК НачислениеСсылка,
		|	ПлановыеНачисления.Размер КАК Размер,
		|	ПлановыеНачисления.Начисление.Наименование КАК НачислениеНаименование
		|ИЗ
		|	РегистрСведений.ПлановыеНачисления КАК ПлановыеНачисления
		|ГДЕ
		|	ПлановыеНачисления.Активность = ИСТИНА
		|	И ПлановыеНачисления.Регистратор = &ЭтотПриказ";
		Оклад = 0;
		ПроцВред = 0;
		Запрос.Параметры.Вставить("ЭтотПриказ",СсылкаНаОбъект);
		ВыбЗапрос = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыбЗапрос.Следующий() Цикл
			Если ВыбЗапрос.НачислениеНаименование = "Оплата по окладу" Или
				ВыбЗапрос.НачислениеНаименование = "Оплата по окладу (по часам)" Тогда
				Оклад = ВыбЗапрос.Размер;
			КонецЕсли;
			Если ВыбЗапрос.НачислениеНаименование = "Надбавка за вредные условия труда" Тогда
				ПроцВред = ВыбЗапрос.Размер;
			КонецЕсли;
		КонецЦикла;
		
		
		СЗ.Добавить(СсылкаНаОбъект.Должность.КоличествоДнейДополнительногоОтпускаВГод,"ДнейДопОтп"); 
		Если Найти(СсылкаНаОбъект.ГрафикРаботы.Наименование,"менны") > 0 Тогда
			ФормаТруда = "     сменный график работы";
		Иначе
			ФормаТруда = "     дневная";
		КонецЕсли;
		СЗ.Добавить("4.8.Время начала и окончания рабочего дня, а так же перерывов для отдыха и питания, выходные дни определяются "+
			"Правилами внутреннего трудового распорядка для работников 'Предприятия'."+Символы.ПС+
			"4.9.Работнику устанавливается при односменном режиме работы продолжительность рабочего дня "+Символы.ПС+
			?(СсылкаНаОбъект.Сотрудник.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский,"          при 36 часовой рабочей недели -  7 час. 12 мин.","          при 40 часовой рабочей недели - 8 час. 00 мин.")+Символы.ПС+
			"4.10.Особенности режима рабочего времени: "+Символы.ПС+ФормаТруда,"Пункты4");
		СЗ.Добавить(Оклад,"ОкладЦифрами");
		Если ПроцВред <> 0 Тогда
			СЗ.Добавить(Строка(СсылкаНаОбъект.Должность.ПроцентНадбавкиЗаВредность)+"%","ВредностьПроцентом");
		Иначе	
			СЗ.Добавить("   ","ВредностьПроцентом");
		КонецЕсли;	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоложенныеВидыЕжегодныхОтпусков.Регистратор КАК Регистратор,
		|	ПоложенныеВидыЕжегодныхОтпусков.Активность КАК Активность,
		|	ПоложенныеВидыЕжегодныхОтпусков.Сотрудник.Ссылка КАК СотрудникСсылка,
		|	ПоложенныеВидыЕжегодныхОтпусков.ВидЕжегодногоОтпуска.Ссылка КАК ВидЕжегодногоОтпускаСсылка,
		|	ПоложенныеВидыЕжегодныхОтпусков.КоличествоДнейВГод КАК КоличествоДнейВГод,
		|	ПоложенныеВидыЕжегодныхОтпусков.ВидЕжегодногоОтпуска.Наименование КАК ВидЕжегодногоОтпускаНаименование
		|ИЗ
		|	РегистрСведений.ПоложенныеВидыЕжегодныхОтпусков КАК ПоложенныеВидыЕжегодныхОтпусков
		|ГДЕ
		|	ПоложенныеВидыЕжегодныхОтпусков.Активность = ИСТИНА
		|	И ПоложенныеВидыЕжегодныхОтпусков.Регистратор = &ЭтотПриказ";
		КолДнОтпВред = 0;
		КолДнОтпКД = 0;
		Запрос.Параметры.Вставить("ЭтотПриказ",СсылкаНаОбъект);
		ВыбЗапрос = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыбЗапрос.Следующий() Цикл
			Если ВыбЗапрос.ВидЕжегодногоОтпускаНаименование = "Отпуск по кол.договору"  Тогда
				КолДнОтпКД = ВыбЗапрос.КоличествоДнейВГод;
			КонецЕсли;
			Если ВыбЗапрос.ВидЕжегодногоОтпускаНаименование = "Отпуск за вредность"  Тогда
				КолДнОтпВред = ВыбЗапрос.КоличествоДнейВГод;
			КонецЕсли;
		КонецЦикла;
		Если КолДнОтпВред <> 0 Тогда
			СЗ.Добавить(КолДнОтпВред,"ДнейДопОтп");
		КонецЕсли;	
		Если КолДнОтпКД <> 0 Тогда
			СЗ.Добавить(КолДнОтпКД,"ДнейОтпКД");
		КонецЕсли;	
		
		Для А=1 по СЗ.Количество() Цикл
			Стр=СЗ.Получить(А-1).Представление;
			Зн=СЗ.Получить(А-1).Значение;
			Попытка
				BMs.Item(Стр).Range.Fields(1).Result.Text=Зн;
			Исключение
				Сообщение.Текст = Зн;
				Сообщение.Сообщить();
			КонецПопытки;
		Конеццикла;
		
	КонеЦцикла;
	
	//Doc.PrintPreview();
	//Doc.ClosePrintPreview();
	//Word.Activate();
	Попытка
		Doc.SaveAs(СохрИмяФайла);
		Сообщение.Текст = "Создан файл: " + СохрИмяФайла; 
		Сообщение.Сообщить();
		Фраза = Макет.ПолучитьОбласть("Область1");
		Фраза.Параметры.Файл = "Word: Создан файл: " + СохрИмяФайла;
		Фраза.Параметры.Приказ = Строка(СсылкаНаОбъект);
		ТекДок.Вывести(Фраза);
	Исключение
		Сообщение.Текст = Строка(ОписаниеОшибки()); 
		Сообщение.Сообщить();
	КонецПопытки;	
	Doc.Close();
	Word.Quit();
	Возврат ТекДок;
КонецФункции

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	//МассивНазначений.Добавить(ПолучитьМетаданныеДокументаПечати());
	МассивНазначений.Добавить("Документ.ПриемНаРаботу"); //Указываем документ к которому делаем внешнюю печ. форму 
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); //может быть - ПечатнаяФорма, ЗаполнениеОбъекта, ДополнительныйОтчет, СозданиеСвязанныхОбъектов... 
	//ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет"); //может быть - ПечатнаяФорма, ЗаполнениеОбъекта, ДополнительныйОтчет, СозданиеСвязанныхОбъектов... 
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "ЖЭУ: печать договора"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
	ПараметрыРегистрации.Вставить("Версия", "1.0"); 
	ПараметрыРегистрации.Вставить("Информация", "ЖЭУ: печать договора"); 
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "ЖЭУ: печать договора", "Печать", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции


Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Сообщение = Новый СообщениеПользователю;
	ТабДок = ПечатьФормы(МассивОбъектов);
	//Сообщение.Текст = Строка(ТабДок);
	//Сообщение.Сообщить();
	//КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	КоллекцияПечатныхФорм.Колонки.Удалить(3);
	КоллекцияПечатныхФорм.Колонки.Удалить(3);
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент", Новый ОписаниеТипов("ТабличныйДокумент"));
	КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров", Новый ОписаниеТипов("Число"));
	КоллекцияПечатныхФорм.Добавить();
	Стр = КоллекцияПечатныхФорм.Получить(0);
	Стр.ТабличныйДокумент = ТабДок;
	Стр.Экземпляров = 1;
	//КоллекцияПечатныхФорм.ТабличныйДокумент = ТабДок;
    УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        УказатьНаименованиеКомандыПечати(),
        УказатьНаименованиеВнешнейПечатнойФормы(),
		ТабДок);
		
КонецПроцедуры
	
