
&После("ОбработкаПроведения")
Процедура Расш1_ОбработкаПроведения(Отказ, РежимПроведения)
	БухДвижения = ЭтотОбъект.Движения.Хозрасчетный;
	Для Каждого Движ Из БухДвижения Цикл
		Если (Движ.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("70")) И (Движ.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.41") ИЛИ Движ.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("71.01")) Тогда
			Движ.СубконтоДт.РаботникиОрганизаций = Справочники.ФизическиеЛица.НайтиПоНаименованию("По всем сотрудникам");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
